SmartTech/nRF52_PN7150/PN7120/library/src/nfc.c
/*******************************************************************************
* Title                 :   System Initialization
* Filename              :   sys_init.c
* Author                :   RBL
* Origin Date           :   04/23/2012
* Notes                 :   None
*******************************************************************************/
/*************** MODULE REVISION LOG ******************************************
*
*    Date    Software Version    Initials   Description
*  20/01/16        .1            RBL      Module Created.
*
*******************************************************************************/
/** @file nfc.c
 *  @brief This module contains the
 */
/******************************************************************************
* Includes
*******************************************************************************/
#include <stdint.h>
#include <string.h>
#include <stdio.h>
#include <stdbool.h>
#include "nfc.h"

#include "nrf.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"

#ifdef CARDEMU_SUPPORT
#include "T4T_NDEF_EMU.h"
#endif
#ifdef P2P_SUPPORT
#include "P2P_NDEF.h"
#endif
#ifdef RW_SUPPORT
#include "RW_NDEF.h"
#include "RW_NDEF_T3T.h"
#endif

/******************************************************************************
* Module Preprocessor Constants
*******************************************************************************/

#define ANSWER_MAX_SIZE 258



/******************************************************************************
* Module Variable Definitions
*******************************************************************************/

static bool volatile rx_flag;
static uint32_t volatile timer_tick;

/******************************************************************************
* Function Prototypes
*******************************************************************************/

static int initialize_core();

static int host_rx(uint8_t* p_rx_buff, uint16_t rx_buff_size,
                   uint16_t *p_nbytes_read, uint16_t timeout);

static int host_tx_rx(uint8_t *p_tx_buff, uint16_t tx_buff_len, uint8_t *p_rx_buff,
                      uint16_t rx_buff_size, uint16_t *p_nbytes_read);

#ifdef CARDEMU_SUPPORT
static void card_mode(nfc_interface_t *rf_intf);
#endif

#ifdef P2P_SUPPORT
static void p2p_mode(nfc_interface_t *rf_intf);
#endif

#ifdef RW_SUPPORT
static void reader_mode(nfc_interface_t *rf_intf);
#endif

/******************************************************************************
* Private Function Definitions
*******************************************************************************/
static int host_rx(uint8_t *p_rx_buff, uint16_t rx_buff_size,
                   uint16_t *p_nbytes_read, uint16_t timeout)
{
    uint8_t *p_rx_buff_ptr = p_rx_buff;
    uint16_t *p_nbytes_read_ptr = p_nbytes_read;

    timer_tick = 0;

    if( nrf_gpio_pin_read(NFC_INT_PIN) == 0 ) {
      if( timeout == TIMEOUT_INFINITE )
      {
         while( !rx_flag );
      }
      else
      {
        while( !rx_flag ) {
            if( timer_tick > timeout ) {
                *p_nbytes_read = 0;
                NFC_LOG_INFO("wait rx_flag timeout");
                NFC_LOG_FLUSH();
                return NFC_ERROR;
            }
        }
      }
      NFC_LOG_INFO("Interrupt handled!");
      NFC_LOG_FLUSH();
    }

    if( nfc_hal_read( p_rx_buff_ptr, p_nbytes_read_ptr, rx_buff_size ) ){
        NFC_LOG_INFO("nfc_hal_read error");
        NFC_LOG_FLUSH();
        *p_nbytes_read = 0;
        return NFC_ERROR;
    }
    
    NFC_LOG_INFO("nfc_hal_read OK!");
    NFC_LOG_FLUSH();

    rx_flag = false;

    return NFC_SUCCESS;
}

static int host_tx_rx (uint8_t *p_tx_buff, uint16_t tx_buff_len, uint8_t *p_rx_buff,
                       uint16_t rx_buff_size, uint16_t *p_nbytes_read )
{
    NFC_LOG_INFO("Host TxRx...");
    NFC_LOG_FLUSH();
    uint8_t *p_tx_buff_ptr = p_tx_buff;
    uint8_t *p_rx_buff_ptr = p_rx_buff;
    uint16_t *p_nbytes_read_ptr = p_nbytes_read;

    if( nfc_hal_write( p_tx_buff_ptr, tx_buff_len ) ) {
        NFC_LOG_INFO("write error!");
        NFC_LOG_FLUSH();
        return NFC_ERROR;
    }
    else if( host_rx( p_rx_buff_ptr, rx_buff_size, p_nbytes_read_ptr, TIMEOUT_1S ) ) {
        NFC_LOG_INFO("host_rx error!");
        NFC_LOG_FLUSH();
        return NFC_ERROR;
    }
    NFC_LOG_INFO("OK!");
    NFC_LOG_FLUSH();
    return NFC_SUCCESS;
}

static int initialize_core( void )
{
    uint8_t answer[ ANSWER_MAX_SIZE ]           = { 0 };
    uint16_t answer_size                        = 0;
    int i                                       = 10;
    uint8_t CORE_RESET_CMD[]                    = { 0x20, 0x00, 0x01, 0x01 };
    uint8_t CORE_INIT_CMD[]                     = { 0x20, 0x01, 0x00 };

    NFC_LOG_INFO("*****Resetting and Initializing Core*****");
    NFC_LOG_FLUSH();
    /* Reset the core */
    while( host_tx_rx( CORE_RESET_CMD, sizeof( CORE_RESET_CMD ), answer, sizeof( answer ), &answer_size ) ) {
        if( !i-- ) {
          NFC_LOG_INFO("host_tx_rx trying error");
          NFC_LOG_FLUSH();
          return NFC_ERROR;
        }
        NFC_LOG_INFO("host_tx_rx error, try again!");
        NFC_LOG_FLUSH();
        nfc_hal_delay( 500 );
    }
    /* Once reset, initialize the core */
    if( host_tx_rx( CORE_INIT_CMD, sizeof( CORE_INIT_CMD ), answer, sizeof( answer ), &answer_size ) )
    {
        NFC_LOG_INFO("host_tx_rx error!");
        NFC_LOG_FLUSH();
        return NFC_ERROR;
    }
    else if( ( answer[ 0 ] != 0x40 ) || \
             ( answer[ 1 ] != 0x01 ) || \
             ( answer[ 3 ] != 0x00 ) )
    {
      NFC_LOG_INFO("answer error!");
      NFC_LOG_FLUSH();
      return NFC_ERROR;
    }
    NFC_LOG_INFO("OK!");
    NFC_LOG_FLUSH();
    return NFC_SUCCESS;
}

#ifdef CARDEMU_SUPPORT

static void card_mode( nfc_interface_t *rf_intf )
{
    uint8_t answer[ ANSWER_MAX_SIZE ]           = { 0 };
    uint16_t answer_size                        = 0;

    t4t_ndef_emu_reset();                                                       /* Reset Card emulation state */

    while( !host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_2S ) ) {
        if( ( answer[ 0 ] == 0x61 ) && ( answer[ 1 ] == 0x06 ) ) {              /* is RF_DEACTIVATE_NTF ? */
            break;                                                              /* Come back to discovery state */
        }
        else if( ( answer[ 0 ] == 0x00 ) && ( answer[ 1 ] == 0x00 ) ) {         /* is DATA_PACKET ? */
            uint8_t cmd[ 256 ];
            uint16_t cmd_size = 0;

            t4t_ndef_emu_next( &answer[ 3 ], answer[ 2 ], &cmd[ 3 ], ( uint16_t * )&cmd_size );

            cmd[ 0 ] = 0x00;
            cmd[ 1 ] = ( cmd_size & 0xFF00 ) >> 8;
            cmd[ 2 ] = cmd_size & 0x00FF;

            host_tx_rx( cmd, cmd_size + 3, answer, sizeof( answer ), &answer_size );
        }
    }
}
#endif

