SmartTech/nRF52_PN7150/PN7120/library/src/nfc.c
#ifdef P2P_SUPPORT

static void p2p_mode( nfc_interface_t *rf_intf )
{
    uint8_t answer[ ANSWER_MAX_SIZE ] = { 0 };
    uint16_t answer_size              = 0;
    uint8_t NCIL_LCP_SYMM[]           = { 0x00, 0x00, 0x02, 0x00, 0x00 };
    uint8_t NCI_RESTART_DISCOVERY[]   = { 0x21, 0x06, 0x01, 0x03 };

    p2p_ndef_reset();                                                           /* Reset P2P_NDEF state */

    if( ( rf_intf->mode_tech & MODE_LISTEN ) != MODE_LISTEN )                   /* Is INITIATOR_MODE ? */ /* Initiate communication ( SYMM PDU ) */
        host_tx_rx( NCIL_LCP_SYMM, sizeof( NCIL_LCP_SYMM ), answer, sizeof( answer ), &answer_size );

    while( !host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_2S ) ){    /* Get frame from remote peer */
        if( ( answer[0] == 0x00 ) && ( answer[1] == 0x00 ) ) {                  /* is DATA_PACKET ? */
            uint8_t cmd[256]  = { 0 };
            uint16_t cmd_size = 0;

            p2p_ndef_next( &answer[ 3 ], answer[ 2 ], &cmd[ 3 ], ( uint16_t * )&cmd_size );

            cmd[ 0 ] = 0x00;                                                    /* Compute DATA_PACKET to answer */
            cmd[ 1 ] = ( cmd_size & 0xFF00 ) >> 8;
            cmd[ 2 ] = cmd_size & 0x00FF;

            host_tx_rx( cmd, cmd_size + 3, answer, sizeof( answer ), &answer_size );
        }
        else if ( ( answer[ 0 ] == 0x60 ) && ( answer[ 1 ] == 0x08 ) ) {        /* is CORE_INTERFACE_ERROR_NTF ?*/
            break;
        }
        else if( ( answer[0] == 0x61 ) && ( answer[1] == 0x06 ) ) {             /* is RF_DEACTIVATE_NTF ? */
            break;                                                              /* Come back to discovery state */
        }
    }

    if( ( rf_intf->mode_tech & MODE_LISTEN ) != MODE_LISTEN ) {                 /* Is Initiator mode ? */ /* Communication ended, restart discovery loop */
        host_tx_rx( NCI_RESTART_DISCOVERY, sizeof( NCI_RESTART_DISCOVERY ), answer, sizeof( answer ), &answer_size );
        host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_2S );
    }
}
#endif

#ifdef RW_SUPPORT
static void reader_mode( nfc_interface_t *rf_intf )
{
    uint8_t answer[ ANSWER_MAX_SIZE ];
    uint8_t cmd[ 256 ]                        = { 0 };
    uint16_t cmd_size                   = 0;
    uint16_t answer_size                = 0;

    uint8_t NCI_PRES_CHECK_T2T[]          = { 0x00, 0x00, 0x02, 0x30, 0x00 };
    uint8_t NCI_POLLING_CMD_T3T[]          = { 0x21, 0x08, 0x04, 0x12, 0xFC, 0x00, 0x01 };
    uint8_t NCI_PRES_CHECK_ISO_DEP[] = { 0x2F, 0x11, 0x00 };
    uint8_t NCI_RESTART_DISCOVERY[]  = { 0x21, 0x06, 0x01, 0x03 };
    uint8_t NCI_PRES_CHECK_T1T[]          = { 0x00, 0x00, 0x07, 0x78, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };

    rw_ndef_reset( rf_intf->protocol );

    if ( rf_intf->protocol == PROT_T3T ){                                      /* In case of T3T tag, retrieve card IDm */
        host_tx_rx( NCI_POLLING_CMD_T3T, sizeof( NCI_POLLING_CMD_T3T ), answer, sizeof( answer ), &answer_size );
        host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_1S );

        if ( ( answer[ 0 ] == 0x61 ) && ( answer[ 1 ] == 0x08 ) && ( answer[ 3 ] == 0x00 ) )
            rw_ndef_t3t_set_id_m( &answer[ 6 ] );
        else
            goto restart_discovery;
    }

    while( 1 )
    {
        rw_ndef_read_next( &answer[ 3 ], answer[ 2 ], &cmd[ 3 ], ( uint16_t * ) &cmd_size );

        if( cmd_size == 0 ) {
            break;                                                              /* End of the Read operation */
        }
        else {

            cmd[ 0 ] = 0x00;                                                    /* Compute and send DATA_PACKET */
            cmd[ 1 ] = ( cmd_size & 0xFF00 ) >> 8;
            cmd[ 2 ] = cmd_size & 0x00FF;

            host_tx_rx( cmd, cmd_size + 3, answer, sizeof( answer ), &answer_size );
            host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_2S );
        }
    }

    switch( rf_intf->protocol )                                                 /* Read Operation ended, perform card presence check */
    {
    case PROT_T1T:

        do {
            nfc_hal_delay( 500 );
            host_tx_rx( NCI_PRES_CHECK_T1T, sizeof( NCI_PRES_CHECK_T1T ), answer, sizeof( answer ), &answer_size );
            host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_1S );
        } while ( ( answer[ 0 ] == 0x00 ) && ( answer[ 1 ] == 0x00 ) );
        break;
    case PROT_T2T:

        do {
            nfc_hal_delay( 500 );
            host_tx_rx( NCI_PRES_CHECK_T2T, sizeof( NCI_PRES_CHECK_T2T ), answer, sizeof( answer ), &answer_size );
            host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_1S );
        } while ( ( answer[ 0 ] == 0x00 ) && ( answer[ 1 ] == 0x00 ) && ( answer[ 2 ] == 0x11 ) );

        break;
    case PROT_ISODEP:

        do {
            nfc_hal_delay( 500 );
            host_tx_rx( NCI_PRES_CHECK_ISO_DEP, sizeof( NCI_PRES_CHECK_ISO_DEP ), answer, sizeof( answer ), &answer_size );
            host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_1S );
        } while ( ( answer[ 0 ] == 0x6F ) && ( answer[ 1 ] == 0x11 ) && ( answer[ 2 ] == 0x01 ) && ( answer[ 3 ] == 0x01 ) );
        break;
    default:

        break;                                                                  /* protocol not supported */
    }
                                                                                /* Communication ended, restart discovery loop */
restart_discovery:

    host_tx_rx( NCI_RESTART_DISCOVERY, sizeof( NCI_RESTART_DISCOVERY ), answer, sizeof( answer ), &answer_size );
    host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_1S );
}

int nfc_reader_tag_cmd
(
        uint8_t *command,
        uint8_t command_size,
        uint8_t *answer,
        uint8_t *answer_size
)
{
    int status = NFC_ERROR;
    uint8_t cmd[ 256 ];
    uint8_t ans[ ANSWER_MAX_SIZE ] = { 0 };
    uint16_t ans_size = 0;;
    
    cmd[ 0 ] = 0x00;                                                            /* Compute and send DATA_PACKET */
    cmd[ 1 ] = 0x00;
    cmd[ 2 ] = command_size;

