SmartTech/nRF52_PN7150/PN7120/library/src/nfc.c
    memcpy( &cmd[ 3 ], command, command_size );
    host_tx_rx( cmd, command_size + 3, ans, sizeof( ans ), &ans_size );         /* Wait for answer */
    host_rx( ans, sizeof( ans ), &ans_size, TIMEOUT_2S );

    if ( ( ans[ 0 ] == 0x0 ) && ( ans[ 1 ] == 0x0 ) )
        status = NFC_SUCCESS;

    *answer_size = ans[ 2 ];

    memcpy( answer, &ans[ 3 ], *answer_size );

    return status;
}
#endif


/******************************************************************************
* Public Function Definitions
*******************************************************************************/

int nfc_init(uint8_t slave_address)
{    
#if defined( TEST_MODE )

    int i, j;

    uint8_t answer[ANSWER_MAX_SIZE] = {0};
    uint16_t answer_size = 0;

    uint8_t CORE_SET_POWER_MODE_CMD[] = { 0x2f, 0x00, 0x01, 0x00 };
    uint8_t TEST_PRBS_CMD[] = { 0x2f, 0x30, 0x04, 0x00, 0x00, 0x00, 0x1f };
    uint8_t TEST_ANTENNA_CMD[] = { 0x2f, 0x3d, 0x05, 0x20, 0x00, 0x00, 0x00, 0x00 };

#endif
    
    if( slave_address != NFC_I2C_SLAVE && slave_address != NFC_I2C_SLAVE_ALT )
    {
       return NFC_ERROR;
    }

    nfc_hal_init(slave_address); /* Open connection to NFC click */

#if defined( TEST_MODE )

    NFC_LOG_INFO( "\r\n*****Entering Test Mode*****\r\n" );
    NFC_LOG_FLUSH();
    initialize_core();    /* Testing needs to disable standby mode.  */
    nrf_delay_ms( 100 );
    NFC_LOG_INFO("*****Disabling Standby Mode*****" );              /* Note - disabling the Standby Mode should be restricted to debug sessions. */
    host_tx_rx( CORE_SET_POWER_MODE_CMD, sizeof( CORE_SET_POWER_MODE_CMD ), answer, sizeof( answer ), &answer_size );
    
    if( answer[ 3 ] == 0x00 ) {
        NFC_LOG_INFO("*****Standby OFF*****" );
        NFC_LOG_FLUSH();
    }
    
    for( i = 0, j = 4; i < 4; i++, j++ )
    {
        NFC_LOG_INFO("*****Testing Antenna*****");
        NFC_LOG_FLUSH();
        TEST_ANTENNA_CMD[ j ] |= 0x01;
        host_tx_rx( TEST_ANTENNA_CMD, sizeof( TEST_ANTENNA_CMD ), answer, sizeof( answer ), &answer_size );
        TEST_ANTENNA_CMD[ j ] &= ~0x01;
        host_tx_rx( TEST_ANTENNA_CMD, sizeof( TEST_ANTENNA_CMD ), answer, sizeof( answer ), &answer_size );
        host_tx_rx( TEST_ANTENNA_CMD, sizeof( TEST_ANTENNA_CMD ), answer, sizeof( answer ), &answer_size );
        TEST_ANTENNA_CMD[ j ] |= 0x01;
        host_tx_rx( TEST_ANTENNA_CMD, sizeof( TEST_ANTENNA_CMD ), answer, sizeof( answer ), &answer_size );
    }

    NFC_LOG_INFO("*****Starting Test Procedure*****");
    NFC_LOG_FLUSH();
    host_tx_rx( TEST_PRBS_CMD, sizeof( TEST_PRBS_CMD ), answer, sizeof( answer ), &answer_size );

    if( answer[ 3 ] == 0x00 ) {
      NFC_LOG_INFO("******Test Successful*****");
    } else {
      NFC_LOG_INFO("!!!!!!Test Failed!!!!!");
    }
    NFC_LOG_FLUSH();
    
    nfc_hal_reset();
    NFC_LOG_INFO("*****Testing Concluded Resetting*****");
    NFC_LOG_FLUSH();
#endif
    
    if( initialize_core() == NFC_ERROR) return NFC_ERROR;

    return NFC_SUCCESS;
}

void nfc_rx_ready()
{
    rx_flag = true;
}

void nfc_timer_tick()
{
    timer_tick++;
}

int nfc_configure( nfc_mode_t mode )
{
    uint8_t  command[ 256 ];
    uint8_t  answer[ ANSWER_MAX_SIZE ] = {0};
    uint16_t answer_size = 0;
    uint8_t  item = 0;

    uint8_t NCI_DISCOVER_MAP_CMD[] = { 0x21, 0x00 };

#ifdef CARDEMU_SUPPORT

    uint8_t DM_CARDEMU[] = { 0x4, 0x2, 0x2 };
    uint8_t R_CARDEMU[]  = { 0x1, 0x3, 0x0, 0x1, 0x4 };
#endif
    
#ifdef P2P_SUPPORT
    uint8_t DM_P2P[] = { 0x5, 0x3, 0x3 };
    uint8_t R_P2P[]  = { 0x1, 0x3, 0x0, 0x1, 0x5 };
    uint8_t NCI_SET_CONFIG_NFC[] = { 0x20, 0x02, 0x1F, 0x02, 0x29, 0x0D, 0x46,
                    0x66, 0x6D, 0x01, 0x01, 0x11, 0x03, 0x02, 0x00, 0x01, 0x04, 0x01,
                    0xFA, 0x61, 0x0D, 0x46, 0x66, 0x6D, 0x01, 0x01, 0x11, 0x03, 0x02,
                    0x00, 0x01, 0x04, 0x01, 0xFA };
#endif
    
#ifdef RW_SUPPORT
    uint8_t NCI_PROPRIETARY_ACT_CMD[] = { 0x2F, 0x02, 0x00 };
    uint8_t DM_RW[] = { 0x1, 0x1, 0x1,  0x2, 0x1, 0x1,  0x3, 0x1, 0x1, 0x4, 0x1,
                    0x2, 0x80, 0x01, 0x80 };
#endif
    
#if defined( P2P_SUPPORT ) || defined( CARDEMU_SUPPORT )
    uint8_t NCI_ROUTING[] = { 0x21, 0x01, 0x07, 0x00, 0x01 };
    uint8_t nci_set_config_nfca_selrsp[] = { 0x20, 0x02, 0x04, 0x01, 0x32, 0x01,
                    0x00 };
#endif

    if( mode == NFC_MODE_NONE ) return NFC_SUCCESS;

#ifdef RW_SUPPORT
    /* Enable Proprietary interface for T4T card presence check procedure */
    if( mode == NFC_MODE_RW ){
        if( host_tx_rx( NCI_PROPRIETARY_ACT_CMD, sizeof( NCI_PROPRIETARY_ACT_CMD ), answer, sizeof( answer ), &answer_size ) )
            return NFC_ERROR;
        else if( ( answer[0] != 0x4F ) || ( answer[1] != 0x02 ) || ( answer[3] != 0x00 ) )
            return NFC_ERROR;
    }
#endif

    item = 0; /* Building Discovery Map command */

#ifdef CARDEMU_SUPPORT
    if( mode & NFC_MODE_CARDEMU ){
        memcpy( &command[ 4 + ( 3 * item ) ], ( void* )DM_CARDEMU, sizeof( DM_CARDEMU ) );
        item++;
    }
#endif
    
#ifdef P2P_SUPPORT
    if( mode & NFC_MODE_P2P ){
        memcpy( &command[ 4 + ( 3 * item ) ], ( void* )DM_P2P, sizeof( DM_P2P ) );
        item++;
    }
#endif
    
#ifdef RW_SUPPORT
    if( mode & NFC_MODE_RW ){
        memcpy( &command[ 4 + ( 3 * item ) ], ( void* )DM_RW, sizeof( DM_RW ) );
        item += sizeof( DM_RW ) / 3;
    }
#endif
    
#if defined P2P_SUPPORT || defined CARDEMU_SUPPORT || defined RW_SUPPORT
    if( item != 0 ){
        memcpy( command, ( void *)NCI_DISCOVER_MAP_CMD, sizeof( NCI_DISCOVER_MAP_CMD ) );
        command[ 2 ] = 1 + ( item * 3 );
        command[ 3 ] = item;
        
        if( host_tx_rx( command, command[ 2 ] + 3, answer, sizeof( answer ), &answer_size ) )
            return NFC_ERROR;
        else if( ( answer[0] != 0x41 ) || ( answer[1] != 0x00 ) || ( answer[3] != 0x00 ) )
            return NFC_ERROR;
    }
#endif

    item = 0;                                                                   /* Configuring routing */

#ifdef CARDEMU_SUPPORT
    if( mode & NFC_MODE_CARDEMU ){
        memcpy( &command[5 + ( 5 * item )], ( void* )R_CARDEMU, sizeof( R_CARDEMU ) );
        item++;
    }
#endif
    
