SmartTech/nRF52_PN7150/PN7120/library/src/nfc.c
#ifdef P2P_SUPPORT
    if( mode & NFC_MODE_P2P ){
        memcpy( &command[5 + ( 5 * item )], ( void* )R_P2P, sizeof( R_P2P ) );
        item++;
    }
#endif
    
#if defined P2P_SUPPORT || defined CARDEMU_SUPPORT
    if( item != 0 ) {
        memcpy( command, ( void* )NCI_ROUTING, sizeof( NCI_ROUTING ) );

        command[ 2 ] = 2 + ( item * 5 );
        command[ 4 ] = item;

        if( host_tx_rx( command, command[ 2 ] + 3, answer, sizeof( answer ), &answer_size ) )
            return NFC_ERROR;
        else if( ( answer[ 0 ] != 0x41 ) || ( answer[ 1 ] != 0x01 ) || ( answer[ 3 ] != 0x00 ) )
            return NFC_ERROR;
    }
#endif
                                                                                /* Setting NFCA SEL_RSP */
#ifdef CARDEMU_SUPPORT
    if( mode & NFC_MODE_CARDEMU ) nci_set_config_nfca_selrsp[ 6 ] += 0x20;
#endif
    
#ifdef P2P_SUPPORT
    if( mode & NFC_MODE_P2P )
        nci_set_config_nfca_selrsp[ 6 ] += 0x40;
#endif
    
#if defined P2P_SUPPORT || defined CARDEMU_SUPPORT
    if( nci_set_config_nfca_selrsp[ 6 ] != 0x00 ){
        if( host_tx_rx( nci_set_config_nfca_selrsp, sizeof( nci_set_config_nfca_selrsp ), answer, sizeof( answer ), &answer_size ) )
            return NFC_ERROR;
        else if( ( answer[ 0 ] != 0x40 ) || ( answer[ 1 ] != 0x02 ) || ( answer[ 3 ] != 0x00 ) )
            return NFC_ERROR;
    }
#endif

#ifdef P2P_SUPPORT
    /* Setting LLCP support */
    if( mode & NFC_MODE_P2P ){
        if( host_tx_rx( NCI_SET_CONFIG_NFC, sizeof( NCI_SET_CONFIG_NFC ), answer, sizeof( answer ), &answer_size ) )
            return NFC_ERROR;
        else if( ( answer[0] != 0x40 ) || ( answer[1] != 0x02 ) || ( answer[3] != 0x00 ) )
            return NFC_ERROR;
    }
#endif

    return NFC_SUCCESS;
}

int nfc_start_discovery( uint8_t *p_tech_tab, uint8_t tech_tab_size )
{
    uint8_t command[ 256 ];
    uint8_t answer[ ANSWER_MAX_SIZE ] = { 0 };
    uint16_t answer_size = 0;
    uint8_t i;

    uint8_t NCI_DISCOVER_CMD[] = { 0x21, 0x03 };

    NFC_LOG_INFO( "*****Discovery Start*****\r\n" );
    NFC_LOG_FLUSH();

    memcpy( command, ( void* )NCI_DISCOVER_CMD, sizeof( NCI_DISCOVER_CMD ) );
    //command[0] = 0x21;
    //command[1] = 0x03;
    command[ 2 ] = ( tech_tab_size * 2 ) + 1;
    command[ 3 ] = tech_tab_size;

    for ( i = 0; i < tech_tab_size; i++ )
    {
        command[ ( i * 2 ) + 4 ] = p_tech_tab[ i ];
        command[ ( i * 2 ) + 5 ] = 0x01;
    }

    if( host_tx_rx( command, ( tech_tab_size * 2 ) + 4, answer, sizeof( answer ), &answer_size ) )
        return NFC_ERROR;
    else if ( ( answer[ 0 ] != 0x41 ) || ( answer[ 1 ] != 0x03 ) || ( answer[ 3 ] != 0x00 ) )
        return NFC_ERROR;

    return NFC_SUCCESS;
}

int nfc_restart_discovery( void )
{
    uint8_t answer[ ANSWER_MAX_SIZE ] = { 0 };
    uint16_t answer_size = 0;
    uint8_t NCI_RESTART_DISCOVERY[] = { 0x21, 0x06, 0x01, 0x03 };

    if( host_tx_rx( NCI_RESTART_DISCOVERY, sizeof( NCI_RESTART_DISCOVERY ), answer, sizeof( answer ), &answer_size ) )
        return NFC_ERROR;
    else if( host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_1S ) )
        return NFC_ERROR;

    return NFC_SUCCESS;
}

int nfc_stop_discovery( void )
{
    uint8_t answer[ ANSWER_MAX_SIZE ] = {0};
    uint16_t answer_size = 0;
    uint8_t NCI_STOP_DISCOVERY[] = { 0x21, 0x06, 0x01, 0x00 };

    if( host_tx_rx( NCI_STOP_DISCOVERY, sizeof( NCI_STOP_DISCOVERY ), answer, sizeof( answer ), &answer_size ) )
        return NFC_ERROR;
    else if( host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_1S ) )
        return NFC_ERROR;

    return NFC_SUCCESS;
}

void nfc_wait_for_discovery_notification( nfc_interface_t *prf_intf )
{
    uint8_t NCIRfDiscoverSelectISO[] = {0x21, 0x04, 0x03, 0x01, PROT_ISODEP, INTF_ISODEP};
    uint8_t NCIRfDiscoverSelectNFC[] = {0x21, 0x04, 0x03, 0x01, PROT_NFCDEP, INTF_NFCDEP};
    uint8_t answer[ ANSWER_MAX_SIZE ] = { 0 };
    uint16_t answer_size = 0;

    do {
        host_rx( answer, sizeof( answer), &answer_size, TIMEOUT_INFINITE );
    } while( ( answer[ 0 ] != 0x61 ) || ( ( answer[ 1 ] != 0x05 ) && ( answer[ 1 ] != 0x03 ) ) );

    if( answer[ 1 ] == 0x05 ){                                                  /* Is RF_INTF_ACTIVATED_NTF ? */
        prf_intf->interface = answer[ 4 ];
        prf_intf->protocol = answer[ 5 ];
        prf_intf->mode_tech = answer[ 6 ];
    }
    else{
        prf_intf->interface = INTF_UNDETERMINED;                                /* RF_DISCOVER_NTF */
        prf_intf->protocol = answer[ 4 ];
        prf_intf->mode_tech = answer[ 5 ];

        while((answer[0] != 0x61) || (answer[1] != 0x03)  || (answer[ answer_size - 1 ] == 0x02 ))
            host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_1S );      /* Remaining NTF ? */

        if(prf_intf->protocol == PROT_ISODEP){                                  /* In case of multi-protocol card, select the ISODEP protocol */
           host_tx_rx(NCIRfDiscoverSelectISO, sizeof(NCIRfDiscoverSelectISO), answer, sizeof(answer), &answer_size);
           if ((answer[0] == 0x41) || (answer[1] == 0x04) || (answer[3] == 0x00)) {
                host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_100MS);
                if ((answer[0] == 0x61) || (answer[1] == 0x05)){
                    prf_intf->interface = answer[4];
                    prf_intf->protocol = answer[5];
                    prf_intf->mode_tech = answer[6];
                }
            }
        }
        else if (prf_intf->protocol == PROT_NFCDEP){                            /* In case of NFCDEP + ISODEP, select the P2P protocol */
            host_tx_rx(NCIRfDiscoverSelectNFC, sizeof(NCIRfDiscoverSelectNFC), answer, sizeof(answer), &answer_size);
            if ((answer[0] == 0x41) || (answer[1] == 0x04) || (answer[3] == 0x00)){
                host_rx( answer, sizeof( answer ), &answer_size, TIMEOUT_100MS);
                if ((answer[0] == 0x61) || (answer[1] == 0x05)){
                    prf_intf->interface = answer[4];
                    prf_intf->protocol = answer[5];
                    prf_intf->mode_tech = answer[6];
                }
            }
        }
    }
}

void nfc_process( uint8_t mode, nfc_interface_t *rf_intf )
{
    switch ( mode )
    {
#ifdef CARDEMU_SUPPORT

    case NFC_MODE_CARDEMU:
        card_mode( rf_intf );
        break;
#endif
#ifdef P2P_SUPPORT

    case NFC_MODE_P2P:
        p2p_mode( rf_intf );
        break;
#endif
#ifdef RW_SUPPORT

    case NFC_MODE_RW:
        reader_mode( rf_intf );
        break;
#endif

    default:
        break;
    }
}

/*************** END OF FUNCTIONS *******************************************/